In [1]:
import numpy as np
import pandas as pd

In [3]:
d={"Team":["A","A","A","A","B","B","B","B"],
   "Points":[30,22,19,14,14,11,20,28]}
df=pd.DataFrame(d)
print(df)

  Team  Points
0    A      30
1    A      22
2    A      19
3    A      14
4    B      14
5    B      11
6    B      20
7    B      28

In [5]:
df

  Team  Points
0    A      30
1    A      22
2    A      19
3    A      14
4    B      14
5    B      11
6    B      20
7    B      28

In [7]:
df.iterrows()

In [15]:
for d in df.iterrows():
    print(d)
    print(type(d))
    print("---------------------------")

(0, Team       A
Points    30
Name: 0, dtype: object)
<class 'tuple'>
---------------------------
(1, Team       A
Points    22
Name: 1, dtype: object)
<class 'tuple'>
---------------------------
(2, Team       A
Points    19
Name: 2, dtype: object)
<class 'tuple'>
---------------------------
(3, Team       A
Points    14
Name: 3, dtype: object)
<class 'tuple'>
---------------------------
(4, Team       B
Points    14
Name: 4, dtype: object)
<class 'tuple'>
---------------------------
(5, Team       B
Points    11
Name: 5, dtype: object)
<class 'tuple'>
---------------------------
(6, Team       B
Points    20
Name: 6, dtype: object)
<class 'tuple'>
---------------------------
(7, Team       B
Points    28
Name: 7, dtype: object)
<class 'tuple'>
---------------------------

In [17]:
for gn,gv in df.iterrows():
    print("----------------------------")
    print("group name=",gn)
    print("group values=",gv)
    print("------------------------------")

----------------------------
group name= 0
group values= Team       A
Points    30
Name: 0, dtype: object
------------------------------
----------------------------
group name= 1
group values= Team       A
Points    22
Name: 1, dtype: object
------------------------------
----------------------------
group name= 2
group values= Team       A
Points    19
Name: 2, dtype: object
------------------------------
----------------------------
group name= 3
group values= Team       A
Points    14
Name: 3, dtype: object
------------------------------
----------------------------
group name= 4
group values= Team       B
Points    14
Name: 4, dtype: object
------------------------------
----------------------------
group name= 5
group values= Team       B
Points    11
Name: 5, dtype: object
------------------------------
----------------------------
group name= 6
group values= Team       B
Points    20
Name: 6, dtype: object
------------------------------
----------------------------
group name= 7
group values= Team       B
Points    28
Name: 7, dtype: object
------------------------------

In [19]:
for gn in df.groupby("Team"):
    print(gn)
    print(type(gn))

('A',   Team  Points
0    A      30
1    A      22
2    A      19
3    A      14)
<class 'tuple'>
('B',   Team  Points
4    B      14
5    B      11
6    B      20
7    B      28)
<class 'tuple'>

In [21]:
for gn,gv in df.groupby("Team"):
    print("------------------------------")
    print(gn)
    print(gv)
    print("-----------------------------")

------------------------------
A
  Team  Points
0    A      30
1    A      22
2    A      19
3    A      14
-----------------------------
------------------------------
B
  Team  Points
4    B      14
5    B      11
6    B      20
7    B      28
-----------------------------

In [23]:
print(type(gn))
print(type(gv))

<class 'str'>
<class 'pandas.core.frame.DataFrame'>

In [28]:
for p in df.groupby("Team")["Points"]:
    print(p[0])
    print(p[1].values)
    print("----------------------------")

A
[30 22 19 14]
----------------------------
B
[14 11 20 28]
----------------------------

In [30]:
# calculate sum points of both team A and team B
df["Total Score"]=df.groupby("Team")["Points"].transform("sum")

In [32]:
df

  Team  Points  Total Score
0    A      30           85
1    A      22           85
2    A      19           85
3    A      14           85
4    B      14           73
5    B      11           73
6    B      20           73
7    B      28           73

In [38]:
# cal the mean the teams
df["Mean Of Teams"]=df.groupby("Team")["Points"].transform("mean")

In [40]:
df

  Team  Points  Total Score  Mean Of Teams
0    A      30           85          21.25
1    A      22           85          21.25
2    A      19           85          21.25
3    A      14           85          21.25
4    B      14           73          18.25
5    B      11           73          18.25
6    B      20           73          18.25
7    B      28           73          18.25

In [42]:
# calculatae the percentage of the scores

In [44]:
df["Percentage"]=df.groupby('Team')["Points"].transform(lambda x:round((x/sum(x))*100,2))

In [46]:
df

  Team  Points  Total Score  Mean Of Teams  Percentage
0    A      30           85          21.25       35.29
1    A      22           85          21.25       25.88
2    A      19           85          21.25       22.35
3    A      14           85          21.25       16.47
4    B      14           73          18.25       19.18
5    B      11           73          18.25       15.07
6    B      20           73          18.25       27.40
7    B      28           73          18.25       38.36